{
  "tutorial": [
    {
      "question": "Waar vind ik mijn hosting?",
      "answerHTML": "Iedere student heeft, op de Hogeschool in Rotterdam, recht op een eigen hosting via de schoolserver. Deze kun je terugvinden op <code>http://stud.hosted.hr.nl/[STUDNUMMER]/</code>. Je kunt hier PHP applicaties op draaien en gebruik maken van een MySQL database, zoals je die kent van XAMPP. Twijfel je of jouw hosting wel bestaat kun je altijd een bericht sturen naar <code>service@hr.nl</code>",
      "link": "wherehost",
      "tags": []
    },
    {
      "question": "Hoe zet ik bestanden op mijn hosting?",
      "answerHTML": "Om bestanden over te zetten, heb je een FTP-programma nodig op jouw computer. Één van de meest gebruikte, gratis programma's is FileZilla. Wil je dus bestanden zetten op jouw hosting, start met het installeren van FileZilla (mocht je moeten kiezen tussen een Client of Server versie; kies altijd voor de client versie).",
      "link": "howhost",
      "tags": []
    },
    {
      "question": "Hoe log ik in op mijn hosting via FileZilla of ander FTP programma?",
      "answerHTML": "In FileZilla heb je, bovenin de app, een quick connect bar:<br/><img src=\"./images/studhosting/filezillaQuickConnect.png\" class=\"responsive\"/><br/><br/>Vul de volgende gegevens in:<ul><li>Host: stud.hosted.hr.nl</li><li>Port kun je leeglaten (pikt de default op)</li><li>User: studentennummer</li><li>Password: HR wachtwoord</li></ul>Let op; de studenthosting benader je altijd via <strong>sFTP</strong>. Dit is een extra beveiligde connectie, die connectie maakt via een specifieke port (die automatisch voor jou wordt ingevuld, als je die leeg laat).",
      "link": "hostingauth",
      "tags": []
    },
    {
      "question": "Ik zie allemaal mappen op de FTP. Waar zet ik mijn bestanden?",
      "answerHTML": "<img src=\"./images/wordpress/readme.png\" class=\"responsive\"/><br/>Benader je jouw hosting via een FTP programma zie je verschillende mappen en bestanden. De 'root' van jouw site (de plek waarvanaf de server snapt dat het jouw website is) is in de map <code>public.www</code>, zet hier jouw bestanden in.",
      "link": "hostdirectory",
      "tags": []
    },
    {
      "question": "Mijn inloggegevens zijn goed, maar FileZilla kan niet verbinden.",
      "answerHTML": "Krijg je een van de volgende meldingen (of vergelijkbaar in het Engels): <code>Fout: verbinding verlopen na 20 seconden inactiviteit</code> of <code>Fout: kan geen verbinding maken met de server</code><br/>De kans is groot, als jouw inloggegevens echt kloppen, dat de hosting momenteel iets overbelast is. Probeer het later nog eens.",
      "link": "noconnection",
      "tags": []
    },
    {
      "question": "Wat zijn mijn database gegevens?",
      "answerHTML": "<img src=\"./images/wordpress/readme.png\" class=\"responsive\"/><br/>Kan je jouw database inloggegevens niet vinden? Deze staan op jouw hosting. Zodra je via een FTP client (zoals FileZilla) inlogt op de hosting zie je hier een <code>readme.txt</code> staan. Hier staan al jouw persoonlijke gegevens in.",
      "link": "databaseauth",
      "tags": []
    },
    {
      "question": "Waar kan ik mijn database vinden?",
      "answerHTML": "Je kunt jouw eigen hosting benaderen door te gaan naar: <code>https://sql.hosted.hr.nl/</code>. Je komt nu op een inlogscherm, waar je de PHPMyAdmin kunt benaderen, zoals je die ook kent van XAMPP. Vul hier de gegevens in die je gevonden hebt in de vorige stap.<br/><br/><strong>Let op:</strong> Je hebt maar één database. Ga je meerdere sites/apps op jouw hosting draaien, ga hier dan tactisch mee om.",
      "link": "wheredb",
      "tags": []
    },
    {
      "question": "Hoe verhuis ik mijn data van PHPMyAdmin op XAMPP naar de hosting?",
      "answerHTML": "Zowel op XAMPP en op de studenthosting benader je de inhoud van jouw database via PHPMyAdmin, een schil om de database heen die het jouw iets makkelijker maakt (mogelijk ziet hier en daar hijs iets anders eruit, maar de functionaliteit blijft hetzelfde).<br/><br/><img src=\"./images/studhosting/phpmyadminexport.png\" class=\"responsive\"/>Ga naar PHPMyAdmin op jouw XAMPP en klik op het tabblad 'Export/Exporteren'.<br/>Hier kun je de wizard volgen waarna je een <code>.sql</code> bestand kunt downloaden.<br/><br/><br/><img src=\"./images/studhosting/phpmyadminimport.png\" class=\"responsive\"/>Als je nu gaat naar de PHPMyAdmin van de studenthosting (<code>https://sql.hosted.hr.nl/</code>) en inlogt heb je een vergelijkbare website. Hier vind je ook het tabblad 'Import/Importeren'. Als je hierop klikt, heb je een mogelijkheid om een bestand te uploaden, hier kun je het <code>.sql</code> bestand uploaden, die je net hebt gemaakt.",
      "link": "wheredb",
      "tags": []
    }
  ]
}