{
  "wordpress": [
    {
      "question": "Hoe log ik in op mijn hosting via FileZilla?",
      "answerHTML": "Vul de volgende gegevens in:<ul><li>Host: stud.hosted.hr.nl</li><li>Port kun je leeglaten (pikt de default op)</li><li>User: studentennummer</li><li>Password: HR wachtwoord</li></ul>Je database gegevens kun je terugvinden in het meest bovenliggende mapje in een readme.txt bestand.",
      "link": "hostingauth",
      "tags": ["hosting", "server"]
    },
    {
      "question": "Mijn inloggegevens zijn goed, maar FileZilla kan niet verbinden.",
      "answerHTML": "Krijg je een van de volgende meldingen (of vergelijkbaar in het Engels): <code>Fout: verbinding verlopen na 20 seconden inactiviteit</code> of <code>Fout: kan geen verbinding maken met de server</code><br/>De kans is groot, als jouw inloggegevens echt kloppen, dat de hosting momenteel iets overbelast is. Probeer het later nog eens.",
      "link": "noconnection",
      "tags": ["hosting", "server"]
    },
    {
      "question": "Ik krijg een 'Verouderde WordPress Pagina'-melding!",
      "answerHTML": "<img src=\"./images/wordpress/oudewordpress.png\" class=\"responsive\"/><br/> Krijg je deze melding, zodra je jouw WordPress installatie probeert te bereiken?<ol><li>Login op jouw hosting.</li><li>Zoek naar een bestandje met de naam: <code>blocked_please_update_wordpress</code> (of iets vergelijkbaars) en verwijder deze.</li><li>Open de website in de browser en ga naar het adminpaneel.</li><li>Voer een update uit.</li></ol>",
      "link": "verouderd",
      "tags": ["hosting", "server"]
    },
    {
      "question": "Ik kan niet meer inloggen (en wachtwoord resetten doet het niet)!",
      "answerHTML": "Probeer op je website het volgende:<ol><li>Ga naar: <a href=\"https://thrivewp.com/wordpress-admin-login-not-working/#password\" target=\"_blank\">https://thrivewp.com/wordpress-admin-login-not-working/#password</a></li><li>Zoek in de pagina naar 'Before you do anything, it is always good you back up the site.'</li><li>En volg de stappen op die website</li></ol>",
      "link": "nietinloggen",
      "tags": ["admin"]
    },
    {
      "question": "Mijn blog staat op /wordpress",
      "answerHTML": "Mocht je wordpress hebben geinstalleerd met een extra wordpress directory(map) in jouw adres, dus heb je:<br/><code>http://stud.hosted.hr.nl/[studentnummer]/wordpress</code><br/>In plaats van:<br/><code>http://stud.hosted.hr.nl/[studentnummer]/</code><br/>Plaats dan direct in je root (public.www map) een nieuw bestand, genaamd index.html, met de volgende inhoud:<br/><code>&lt;script&gt; window.location.href = \"wordpress\"; &lt;/script&gt;</code>",
      "link": "urlverkeerd",
      "tags": ["hosting", "server"]
    },
    {
      "question": "Ik wil een site draaien naast mijn blog",
      "answerHTML": "Ga je een site maken voor CLE? En is het je niet duidelijk hoe je de bestanden van jouw site op je studentenhosting kan zetten (naast WordPress)?<ol><li>m dit te kunnen heb je weer toegang nodig tot de server d.m.v. FileZilla (of een ander FTP programma).</li><li>Maak in de root (de <strong>public.www</strong> map) een nieuwe map aan. De map komt te staan naast <strong>wp-includes, wp-content, etc.</strong> (Mocht je WordPress hebben geinstalleerd in een diepere <strong>wordpress</strong> map, maak je een nieuwe map naast de <strong>wordpress</strong> map deze aan).</li><li>Noem deze map bijvoorbeeld <strong>cle1onepager</strong> (of andere duidelijke naam).</li><li>In deze map kun je jouw HTML bestanden, javascript bestanden, CSS bestanden en plaatjes plaatsen.</li><li>Zodra je de map hebt aangemaakt kun je deze benaderen door in de browser te gaan naar:<br/><code>http://stud.hosted.hr.nl/[STUDNR]/cle1onepager</code></li></ol>",
      "link": "meerdere",
      "tags": ["hosting", "server"]
    },
    {
      "question": "Ik wil mijn posts (berichten) categoriseren per CLE.",
      "answerHTML": "Categorieën zijn nuttig om te gebruiken voor jouw posts (berichten), Lees in de volgende tutorial hoe je deze aanmaakt, gebruikt en er een passende link voor aanmaakt in je navigatie:<br/><a href=\"https://www.wpbeginner.com/glossary/category/\" target=\"_blank\">https://www.wpbeginner.com/glossary/category/</a>",
      "link": "categorie",
      "tags": ["admin"]
    }
  ]
}