{
    "tutorial": [
      {
        "question": "Waar kan ik meer informatie vinden over het StadsLab?",
        "answerHTML": "Het StadsLab op de Wijnhaven heeft zijn eigen website: <a href=\"https://stadslabrotterdam.nl/\" target=\"_blank\">https://stadslabrotterdam.nl/</a>.<br/><br/>Hierop kun je terugvinden:<ul><li>Evenementen</li><li><a href=\"https://stadslabrotterdam.nl/kosten/\" target=\"_blank\">Actuele kosten voor materialen</a></li><li><a href=\"https://stadslabrotterdam.nl/reserveer/\" target=\"_blank\">Bookingstool voor de machines</a></li></ul>",
        "link": "stadslab",
        "tags": []
      },
      {
        "question": "Wat zijn handige tools voor de machines in het StadsLab?",
        "answerHTML": "<strong>Algemeen:</strong><ul><li><a href=\"https://www.instructables.com/\" target=\"_blank\">Instructables</a> (Een site met verschillende voorbeeldprojecten voor allerlei soorten machines.)</li><li><a href=\"https://www.thingiverse.com/\" target=\"_blank\">Thingiverse</a> (Een site met verschillende voorbeeldprojecten voor allerlei soorten machines.)</li></ul><strong>Lasersnijden en vinylsnijden:</strong><br/>Voor lasersnijden en vinylsnijden kun je ontwerpen maken en aanpassen in Adobe Illustrator (betaald) en Inkscape (gratis).<ul><li><a href=\"https://www.makercase.com/\" target=\"_blank\">Makercase.com</a> (Maakt ontwerpen voor verschillende soorten doosjes voor de lasersnijder.)</li><li><a href=\"https://www.festi.info/boxes.py/\" target=\"_blank\">Boxes.py</a> (Maakt ontwerpen voor verschillende soorten doosjes en andere 3D objecten voor de lasersnijder.)</li></ul><strong>3D printen:</strong><ul><li><a href=\"https://www.tinkercad.com/\" target=\"_blank\">TinkerCAD</a> (Een gratis online tool om 3D ontwerpen mee te maken voor de 3D printer.)</li></ul>",
        "link": "tools",
        "tags": []
      },
      {
        "question": "Ik wil buiten het keuzevak een machine gebruiken. Hoe regel ik dat?",
        "answerHTML": "Tijdens het keuzevak is er altijd de mogelijkheid om de machines te gebruiken, maar het kan wel eens gebeuren dat je wilt werken buiten de tijden van het keuzevak. Het is mogelijk dat de machine die je wilt gebruiken vrij is en je hem direct kunt gebruiken, maar wil je hier zeker van zijn maakt het StadsLab gebruik van <a href=\"https://stadslabrotterdam.nl/reserveer/\" target=\"_blank\">een bookingstool</a>.",
        "link": "reserve",
        "tags": []
      },
      {
        "question": "Ik wil een microcontroller kit/onderdelen lenen of kopen voor het keuzevak. Hoe doe ik dat?",
        "answerHTML": "De balie bij de ingang van Wijnhaven 99 is tijdens werktijden open voor lenen of kopen (heb je het keuzevak op dinsdagavond, kun je dus voor de les en donderdagochtend kun je na de les hier terecht).<br/>Ben je benieuwd wat beschikbaar is? <a href=\"http://uitleen.cmi.hr.nl/\" target=\"_blank\">Kijk hier voor het actuele aanbod</a> (klik linksonder op <strong>overzicht</strong>).",
        "link": "borrow",
        "tags": []
      },
      {
        "question": "Ik heb geen ervaring met microcontrollers, wat raad je mij voor dit keuzevak?",
        "answerHTML": "Geen nood! Een leuk instapmodel is de <strong>MicroBit</strong> van de BBC. Deze kun je lenen tijdens het keuzevak aan de balie op Wijnhaven 99. Programmeren doe je in <a href=\"https://makecode.microbit.org/\" target=\"_blank\">MakeCode</a>, wat een makkelijke tool is om snel een programmaatje voor de MicroBit te schrijven. Hier kun je ook verschillende tutorials vinden.",
        "link": "starter",
        "tags": []
      }
    ]
}